import pytest

from credit import credit

def test_credit1():
    assert credit(100000.0, 20, 4) == ['1 100000.0 1666.67 26666.67 25000.0 75000.0', '2 75000.0 1250.0 26250.0 25000.0 50000.0', '3 50000.0 833.33 25833.33 25000.0 25000.0', '4 25000.0 416.67 25416.67 25000.0 0.0']
def test_credit2():
    assert credit(500000.0, 20, 4) == ['1 500000.0 8333.33 133333.33 125000.0 375000.0', '2 375000.0 6250.0 131250.0 125000.0 250000.0', '3 250000.0 4166.67 129166.67 125000.0 125000.0', '4 125000.0 2083.33 127083.33 125000.0 0.0']

def test_credit3():
    assert credit(500000.0, 50, 4) == ['1 500000.0 20833.33 145833.33 125000.0 375000.0', '2 375000.0 15625.0 140625.0 125000.0 250000.0', '3 250000.0 10416.67 135416.67 125000.0 125000.0', '4 125000.0 5208.33 130208.33 125000.0 0.0']

def test_credit4():
    assert credit(500000.0, 50, 5) == ['1 500000.0 20833.33 120833.33 100000.0 400000.0', '2 400000.0 16666.67 116666.67 100000.0 300000.0', '3 300000.0 12500.0 112500.0 100000.0 200000.0', '4 200000.0 8333.33 108333.33 100000.0 100000.0', '5 100000.0 4166.67 104166.67 100000.0 0.0']

def test_credit5():
    assert credit('h', 50, 5) == 'Введены некорректные данные'

def test_credit6():
    assert credit(100000.0, 'g', 5) == 'Введены некорректные данные'

def test_credit7():
    assert credit(100000.0, 50, 'f') == 'Введены некорректные данные'
    
def test_credit8():
    assert credit(-100000, 50, 5) == 'Введите положительное число'

def test_credit9():
    assert credit(100000.0, -50, 5) == 'Введите положительное число'

def test_credit10():
    assert credit(-100000, 50, -5) == 'Введите положительное число'

def test_credit11():
    assert credit(0, 50, 5) == 'Введите положительное число'

def test_credit12():
    assert credit(100000.0, 0, 5) == 'Введите положительное число'

def test_credit13():
    assert credit(100000.0, 50, 0) == 'Введите положительное число'

def test_credit14():
    assert credit(100000.0, 50, 5.7) == 'Срок должен быть целым числом'








